<template><div><h3 id="что-такое-реактивность" tabindex="-1"><a class="header-anchor" href="#что-такое-реактивность"><span>Что такое реактивность?</span></a></h3>
<p>Это парадигма программирования, которая реализует автоматическую синхронизацию между моделью (данными) и представлением (интерфейсом). При изменении данных - изменяется интерфейс.</p>
<h3 id="ref" tabindex="-1"><a class="header-anchor" href="#ref"><span>ref()</span></a></h3>
<p>Оборачивает примитивный тип данных в прокси-объект, делая эти данные реактивными.<br>
Так как в нативном javascript нет возможности отслеживать изменение данных и их зависимостей, Vue использует прокси-обект который как раз позволяет отслеживать изменения данных и их зависимостей, тем самым реализуя реактивность.</p>
<h3 id="reactive" tabindex="-1"><a class="header-anchor" href="#reactive"><span>reactive()</span></a></h3>
<p>Реализует <code v-pre>глубокую реактивность</code>, оборачивает массивы, объекты любой вложенности, коллекции <code v-pre>Map</code>, <code v-pre>Set</code> в прокси-обект, делая значения, в не зависимости от глубины вложенности, реактивными.</p>
<h3 id="чем-отличаются-ref-от-reactie" tabindex="-1"><a class="header-anchor" href="#чем-отличаются-ref-от-reactie"><span>Чем отличаются ref от reactie?</span></a></h3>
<p>Основное отличие в том, что <code v-pre>reactive()</code> работает с глубоко вложенными объектами.</p>
<h3 id="computed" tabindex="-1"><a class="header-anchor" href="#computed"><span>computed()</span></a></h3>
<p>Возвращает вычисленное значение, на основе реактивных зависимостей.<br>
То есть, у нас есть реактивные данные, нам нужно что-то вычислить используя эти реактивные данные, для этого и используется <code v-pre>computed()</code>, главной особенностью которого является кеширование, которое позволяет возвращать значение из кеша, если реактивные зависимости не менялись.<br>
По умолчанию вычесленное значение является <code v-pre>readonly</code>, которое не рекомендуется менять.<br>
Но также, существует возможность менять реактивные зависимости используя метод <code v-pre>set()</code>, но данный подход не рекомендуется к использованию.</p>
<h3 id="readonly" tabindex="-1"><a class="header-anchor" href="#readonly"><span>readonly()</span></a></h3>
<p>Принимает данные и возвращает их <code v-pre>readonly</code> копию.</p>
<h3 id="watch" tabindex="-1"><a class="header-anchor" href="#watch"><span>watch()</span></a></h3>
<p>Наблюдает за указаными данными, запускает callback при их изменении.</p>
</div></template>


