<template><div><h3 id="что-такое-реактивность" tabindex="-1"><a class="header-anchor" href="#что-такое-реактивность"><span>Что такое реактивность?</span></a></h3>
<p>Это парадигма программирования, которая реализует автоматическую синхронизацию между моделью (данными) и представлением (интерфейсом). При изменении данных - изменяется интерфейс.</p>
<h3 id="ref" tabindex="-1"><a class="header-anchor" href="#ref"><span>ref()</span></a></h3>
<p>Оборачивает примитивный тип данных в прокси-объект, делая эти данные реактивными.<br>
Так как в нативном javascript нет возможности отслеживать изменение данных и их зависимостей, Vue использует прокси-обект который как раз позволяет отслеживать изменения данных и их зависимостей, тем самым реализуя реактивность.</p>
<h3 id="reactive" tabindex="-1"><a class="header-anchor" href="#reactive"><span>reactive()</span></a></h3>
<p>Реализует <code v-pre>глубокую реактивность</code>, оборачивает массивы, объекты любой вложенности, коллекции <code v-pre>Map</code>, <code v-pre>Set</code> в прокси-обект, делая значения, в не зависимости от глубины вложенности, реактивными.</p>
<h3 id="чем-отличаются-ref-от-reactie" tabindex="-1"><a class="header-anchor" href="#чем-отличаются-ref-от-reactie"><span>Чем отличаются ref от reactie?</span></a></h3>
<p>Основное отличие в том, что <code v-pre>reactive()</code> работает с глубоко вложенными объектами.</p>
</div></template>


